src/bsl/InformationRegisters/гкс_СоответствиеОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоответствиеОбъектовWarehouse</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаИБ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_WarehouseСинхронизируемыеСсылки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаWarehouse</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_WarehouseСправочники</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ссылку подсистемы Warehouse соотвествующую ссылке на объект.
//
// Параметры:
//  СсылкаНаОбъект - ссылка на объект информационной базы.
//
// Возвращаемое значение:
//  	ЛюбаяСсылка - ссылка на объект подситестемы Warehouse.
//
Функция СсылкаWarehouseПоСсылкеОбъекта(СсылкаНаОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеОбъектовWarehouse.СсылкаWarehouse КАК СсылкаWarehouse
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеОбъектовWarehouse КАК СоответствиеОбъектовWarehouse
		|ГДЕ
		|	СоответствиеОбъектовWarehouse.СсылкаИБ = &СсылкаНаОбъект";

	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.СсылкаWarehouse;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Получает ссылку объекта соотвествующую ссылке подсистемы Warehouse.
//
// Параметры:
//  СсылкаWarehouse - ссылка на объект подситестемы Warehouse
//
// Возвращаемое значение:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка объекта.
//
Функция СсылкаОбъектаПоСсылкеWarehouse(СсылкаWarehouse) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеОбъектовWarehouse.СсылкаИБ КАК СсылкаИБ
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеОбъектовWarehouse КАК СоответствиеОбъектовWarehouse
		|ГДЕ
		|	СоответствиеОбъектовWarehouse.СсылкаWarehouse = &СсылкаWarehouse";

	Запрос.УстановитьПараметр("СсылкаWarehouse", СсылкаWarehouse);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.СсылкаИБ;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
